from Write_To_CSV_File import Write_To_CSV_File
import csv

if __name__ == '__main__':
    Name_list = [
        "地区生产总值",   # 1
        "第一产业增加值",  # 2
        "第二产业增加值",  # 3
        "第三产业增加值",  # 4
        "年末户籍人口",   # 5
        "城镇非私营单位在岗职工平均工资",  # 6
        "房地产开发投资额", # 7
        "房地产开发住宅投资额",   # 8
        "房地产开发办公楼投资额",  # 9
        "房地产开发商业营业用房投资额",  # 10
        "房地产开发企业施工房屋面积",   # 11
        "房地产开发企业竣工房屋面积",   # 12
        "房地产开发企业住宅竣工房屋面积",   # 13(不知道为什么报错)
        "商品房销售面积",   # 14
        "住宅商品房销售面积",   # 15
        "商品房平均销售价格",   # 16
        "住宅商品房平均销售价格",   # 17
        "房地产开发企业购置土地面积",   # 18
        "地方一般公共预算收入", # 19
        "地方一般公共预算支出", # 20
        "住户存款余额",   # 21
        "旅客运输量",   # 22
        "货物运输量",   # 23
        "年末邮政局",   # 24
        "年末固定电话用户",   # 25
        "社会消费品零售总额",   # 26
        "货物进出口总额",   # 27
        "普通本专科在校学生数",   # 28
        "医院数",   # 29
        "执业(助理)医师数",   # 30
        "剧场、影剧院数",   # 31
        "开发区高新技术企业数",   # 32
        "开发区高新技术企业从业人员",   # 33
        "开发区高新技术企业总产值",   # 34
        "开发区高新技术企业总收入",   # 35
        "开发区高新技术企业出口总额",   # 36
        "道路交通等效声级dB",   # 37
        "环境噪声等效声级dB"    # 38
    ]
    # print(len(Name_list))
    print("请选择要爬取的数据选项：")
    for i,j in zip(range(len(Name_list)), Name_list):
        print(i+1,j)

    print()
    print()
    print("输入对应数字(输入47结束选择)")
    i = 1
    num = None
    num_list = []
    while num!=47:
        print(f"请输入第{i}项需要爬取的数据(输入的数字1~38)：（全部爬取请输入1108）")
        num = int(input())
        if num == 1108:
            num_list = [1,2,3,4,5,6,7,8,9,10,11,12,13,
                        14,15,16,17,18,19,20,21,22,
                        23,24,25,26,27,28,29,30,31,
                        32,33,34,35,36,37,38]
            break
        if num == 47:
            break
        if num < 1 or num >38:
            print("请输入范围内的数字！")
            i += 0
        else:
            num_list.append(num)
            i += 1
    # print(num_list)

    # num_list = [1,2,3,4,5,6,8,9,10,19,20,21,24,25,26,28,29,30,37,38]
    print("请输入要创建的目录名称：")
    DirName = input()

    Write_To_CSV_File(DirName, Name_list, num_list)



