def Show_current_data(year, i, title, current_data):
    city_name = ['北京', '天津', '石家庄', '太原', 
                 '呼和浩特', '沈阳', '大连', '长春'
                 , '哈尔滨', '上海', '南京', '杭州'
                 , '宁波', '合肥', '福州', '厦门'
                 , '南昌', '济南', '青岛', '郑州'
                 , '武汉', '长沙', '广州', '深圳'
                 , '南宁', '海口', '重庆', '成都'
                 , '贵阳', '昆明', '拉萨', '西安'
                 , '兰州', '西宁', '银川', '乌鲁木齐']
    print(f"当前数据：   {year}年---{city_name[i-1]}---{title}：{current_data}")